Autodesk.Revit.DB.RevitUIFamilyLoadOptions.OnSharedFamilyFound(Autodesk.Revit.DB.Family,System.Boolean,Autodesk.Revit.DB.FamilySource@,System.Boolean@)
Implements the interface method by using the Revit dialog box to handle this situation.
Remarks:  A Revit dialog box will be shown with the question about the conflict between shared families versions
in target document and current family.
The user may choose the response. If the response is to cancel the load of the family, an exception
will be thrown from LoadFamily

Autodesk.Revit.DB.RevitUIFamilyLoadOptions.OnFamilyFound(System.Boolean,System.Boolean@)
Implements the interface method by using the Revit dialog box to handle this situation.
Remarks:  A Revit dialog box will be shown with the question about the conflict between families.
The user may choose the response. If the response is to cancel the load of the family, an exception
will be thrown from LoadFamily

Autodesk.Revit.DB.RevitUIFamilyLoadOptions
A private implementation. Allows you to use Revit's dialog boxes to let the user respond to questions that arise during loading of families.